package Monopoly.legacy.plot.country;

import Monopoly.legacy.map.Map;

import java.util.HashMap;

public class CountryManage {
    public static final HashMap<Integer, Country> countries = new HashMap<>();

    public CountryManage() {
        Object[][] data = new Object[22][];  // 国家数据
        for (int i = 0; i < data.length; i++) {
            data[i] = new Object[14];  // 对每个内部数组进行初始化
        }

        data[0][0] = 1;      data[0][1] = "美国";  data[0][2] = "伦敦";  data[0][3] = "粉红色";
        data[0][4] = 350;    data[0][5] = 1750;   data[0][6] = 5000;   data[0][7] = 11000;  data[0][8] = 13000;data[0][9] = 15000;
        data[0][10] = 2000;  data[0][11] = 2000;  data[0][12] = 1750; data[0][13] = 3500;

        data[1][0] = 2;      data[1][1] = "加拿大";  data[1][2] = "渥太华";  data[1][3] = "粉红色";
        data[1][4] = 350;    data[1][5] = 1750;   data[1][6] = 5000;   data[1][7] = 11000;  data[1][8] = 13000;data[1][9] = 15000;
        data[1][10] = 2000;  data[1][11] = 2000;  data[1][12] = 1750;  data[1][13] = 3500;

        data[2][0] = 3;      data[2][1] = "阿根廷";  data[2][2] = "布宜诺斯艾利斯";  data[2][3] = "黄色";
        data[2][4] = 60;    data[2][5] = 300;   data[2][6] = 900;   data[2][7] = 2700;  data[2][8] = 4000;data[2][9] = 5500;
        data[2][10] = 500;  data[2][11] = 500;  data[2][12] = 500;  data[2][13] = 1000;

        data[3][0] = 4;      data[3][1] = "墨西哥";  data[3][2] = "墨西哥城";  data[3][3] = "黄色";
        data[3][4] = 60;    data[3][5] = 300;   data[3][6] = 900;   data[3][7] = 2700;  data[3][8] = 4000;data[3][9] = 5500;
        data[3][10] = 500;  data[3][11] = 500;  data[3][12] = 500;  data[3][13] = 1000;

        data[4][0] = 5;      data[4][1] = "古巴";  data[4][2] = "哈瓦那";  data[4][3] = "黄色";
        data[4][4] = 260;    data[4][5] = 1300;   data[4][6] = 3900;   data[4][7] = 9000;  data[4][8] = 11000;data[4][9] = 12750;
        data[4][10] = 2000;  data[4][11] = 2000;  data[4][12] = 1500;  data[4][13] = 3000;

        data[5][0] = 6;      data[5][1] = "法国";  data[5][2] = "巴黎";  data[5][3] = "紫色";
        data[5][4] = 260;    data[5][5] = 1300;   data[5][6] = 3900;   data[5][7] = 9000;  data[5][8] = 11000;data[5][9] = 12750;
        data[5][10] = 2000;  data[5][11] = 2000;  data[5][12] = 1500;  data[5][13] = 3000;

        data[6][0] = 7;      data[6][1] = "德国";  data[6][2] = "柏林";  data[6][3] = "紫色";
        data[6][4] = 200;    data[6][5] = 1000;   data[6][6] = 3000;   data[6][7] = 7500;  data[6][8] = 9250;data[6][9] = 11000;
        data[6][10] = 1500;  data[6][11] = 1500;  data[6][12] = 1200;  data[6][13] = 2400;

        data[7][0] = 8;      data[7][1] = "意大利";  data[7][2] = "罗马";  data[7][3] = "紫色";
        data[7][4] = 100;    data[7][5] = 500;   data[7][6] = 1500;   data[7][7] = 4500;  data[7][8] = 6250;data[7][9] = 7500;
        data[7][10] = 1000;  data[7][11] = 1000;  data[7][12] = 700;  data[7][13] = 1400;

        data[8][0] = 9;      data[8][1] = "西班牙";  data[8][2] = "马德里";  data[8][3] = "橙色";
        data[8][4] = 100;    data[8][5] = 500;   data[8][6] = 1500;   data[8][7] = 4500;  data[8][8] = 6250;data[8][9] = 7500;
        data[8][10] = 1000;  data[8][11] = 1000;  data[8][12] = 700;  data[8][13] = 1400;

        data[9][0] = 10;      data[9][1] = "希腊";  data[9][2] = "雅典";  data[9][3] = "橙色";
        data[9][4] = 120;    data[9][5] = 600;   data[9][6] = 1800;   data[9][7] = 5000;  data[9][8] = 7000;data[9][9] = 9000;
        data[9][10] = 1000;  data[9][11] = 1000;  data[9][12] = 800;  data[9][13] = 1600;

        data[10][0] = 11;      data[10][1] = "荷兰";  data[10][2] = "阿姆斯特丹";  data[10][3] = "橙色";
        data[10][4] = 200;    data[10][5] = 1000;   data[10][6] = 3000;   data[10][7] = 7500;  data[10][8] = 9250;data[10][9] = 11000;
        data[10][10] = 1500;  data[10][11] = 1500;  data[10][12] = 1200;  data[10][13] = 2400;

        data[11][0] = 12;      data[11][1] = "英国";  data[11][2] = "伦敦";  data[11][3] = "红色";
        data[11][4] = 180;    data[11][5] = 900;   data[11][6] = 2500;   data[11][7] = 7000;  data[11][8] = 8750;data[11][9] = 10500;
        data[11][10] = 1500;  data[11][11] = 1500;  data[11][12] = 1100;  data[11][13] = 2200;

        data[12][0] = 13;      data[12][1] = "俄罗斯";  data[12][2] = "莫斯科";  data[12][3] = "红色";
        data[12][4] = 60;    data[12][5] = 300;   data[12][6] = 900;   data[12][7] = 2700;  data[12][8] = 4000;data[12][9] = 5500;
        data[12][10] = 500;  data[12][11] = 500;  data[12][12] = 500;  data[12][13] = 1000;

        data[13][0] = 14;      data[13][1] = "泰国";  data[13][2] = "曼谷";  data[13][3] = "红色";
        data[13][4] = 140;    data[13][5] = 700;   data[13][6] = 2000;   data[13][7] = 5500;  data[13][8] = 7500;data[13][9] = 9500;
        data[13][10] = 1000;  data[13][11] = 1000;  data[13][12] = 900;  data[13][13] = 1800;

        data[14][0] = 15;      data[14][1] = "土耳其";  data[14][2] = "安卡拉";  data[14][3] = "蓝色";
        data[14][4] = 350;    data[14][5] = 1750;   data[14][6] = 5000;   data[14][7] = 11000;  data[14][8] = 13000;data[14][9] = 15000;
        data[14][10] = 2000;  data[14][11] = 2000;  data[14][12] = 1750;  data[14][13] = 3500;

        data[15][0] = 16;      data[15][1] = "澳大利亚";  data[15][2] = "堪培拉";  data[15][3] = "蓝色";
        data[15][4] = 280;    data[15][5] = 1500;   data[15][6] = 4500;   data[15][7] = 10000;  data[15][8] = 12000;data[15][9] = 14000;
        data[15][10] = 2000;  data[15][11] = 2000;  data[15][12] = 1600;  data[15][13] = 3200;

        data[16][0] = 17;      data[16][1] = "新加坡";  data[16][2] = "新加坡";  data[16][3] = "蓝色";
        data[16][4] = 260;    data[16][5] = 1300;   data[16][6] = 3900;   data[16][7] = 9000;  data[16][8] = 11000;data[16][9] = 12750;
        data[16][10] = 2000;  data[16][11] = 2000;  data[16][12] = 1500;  data[16][13] = 3000;

        data[17][0] = 18;      data[17][1] = "韩国";  data[17][2] = "首尔(汉城)";  data[17][3] = "咖啡色";
        data[17][4] = 60;    data[17][5] = 300;   data[17][6] = 900;   data[17][7] = 2700;  data[17][8] = 4000;data[17][9] = 5500;
        data[17][10] = 500;  data[17][11] = 500;  data[17][12] = 500;  data[17][13] = 1000;

        data[18][0] = 19;      data[18][1] = "中华人民共和国";  data[18][2] = "北京";  data[18][3] = "咖啡色";
        data[18][4] = 500;    data[18][5] = 2000;   data[18][6] = 6000;   data[18][7] = 14000;  data[18][8] = 17000;data[18][9] = 20000;
        data[18][10] = 2000;  data[18][11] = 2000;  data[18][12] = 2000;  data[18][13] = 4000;

        data[19][0] = 20;      data[19][1] = "中国香港";  data[19][2] = "香港特别行政区";  data[19][3] = "咖啡色";
        data[19][4] = 220;    data[19][5] = 1200;   data[19][6] = 3600;   data[19][7] = 8500;  data[19][8] = 10250;data[19][9] = 12000;
        data[19][10] = 1500;  data[19][11] = 1500;  data[19][12] = 1400;  data[19][13] = 2800;

        data[20][0] = 21;      data[20][1] = "日本";  data[20][2] = "东京";  data[20][3] = "绿色";
        data[20][4] = 60;    data[20][5] = 300;   data[20][6] = 900;   data[20][7] = 2700;  data[20][8] = 4000;data[20][9] = 5500;
        data[20][10] = 500;  data[20][11] = 500;  data[20][12] = 500;  data[20][13] = 1000;

        data[21][0] = 22;      data[21][1] = "巴西";  data[21][2] = "巴西利亚";  data[21][3] = "绿色";
        data[21][4] = 140;    data[21][5] = 700;   data[21][6] = 2000;   data[21][7] = 5500;  data[21][8] = 7500;data[21][9] = 9500;
        data[21][10] = 1000;  data[21][11] = 1000;  data[21][12] = 900;  data[21][13] = 1800;

        for (int i = 1; i < Map.map.length; i++) {
            if (Map.map[i][1] == "country") {
                for (Object[] object : data) {
                    if (object[1] == Map.map[i][0]) {
                        Country country = new Country((int)object[0], (String)object[1], (String)object[2], (String)object[3], (int)object[13], (int)object[4], (int)object[5], (int)object[6], (int)object[7], (int)object[8], (int)object[9], (int)object[10], (int)object[11], (int)object[12]);
                        countries.put(i, country);
                    }
                }
            }
        }
    }
}

